pftbest/msp430_svd/msp430-gcc-support-files/include/msp430fr2673.h
/* SYSCFG0 Control Bits */
#define PFWP                             (0x0001)        /* */
#define PFWP_L                           (0x0001)
#define PFWP_0                           (0x0000)        /* Program FRAM write enable */
#define PFWP_1                           (0x0001)        /* Program FRAM write protected (not writable) */
#define PFWP_1_L                         (0x0001)
#define PFWP__WEN                        (0x0000)        /* Program FRAM write enable */
#define PFWP__WPROT                      (0x0001)        /* Program FRAM write protected (not writable) */
#define PFWP__WPROT_L                    (0x0001)
#define FRWPPW                           (0xa500)        /* FRWPPW password. */
#define FRWPPW_H                         (0x00a5)
#define FRWPPW0                          (0x0100)        /* FRWPPW password. */
#define FRWPPW0_H                        (0x0001)
#define FRWPPW1                          (0x0200)        /* FRWPPW password. */
#define FRWPPW1_H                        (0x0002)
#define FRWPPW2                          (0x0400)        /* FRWPPW password. */
#define FRWPPW2_H                        (0x0004)
#define FRWPPW3                          (0x0800)        /* FRWPPW password. */
#define FRWPPW3_H                        (0x0008)
#define FRWPPW4                          (0x1000)        /* FRWPPW password. */
#define FRWPPW4_H                        (0x0010)
#define FRWPPW5                          (0x2000)        /* FRWPPW password. */
#define FRWPPW5_H                        (0x0020)
#define FRWPPW6                          (0x4000)        /* FRWPPW password. */
#define FRWPPW6_H                        (0x0040)
#define FRWPPW7                          (0x8000)        /* FRWPPW password. */
#define FRWPPW7_H                        (0x0080)
#define DFWP                             (0x0002)        /* */
#define DFWP_L                           (0x0002)
#define DFWP_0                           (0x0000)        /* Data FRAM write enable */
#define DFWP_1                           (0x0002)        /* Data FRAM write protected (not writable) */
#define DFWP_1_L                         (0x0002)
#define DFWP__WEN                        (0x0000)        /* Data FRAM write enable */
#define DFWP__WPROT                      (0x0002)        /* Data FRAM write protected (not writable) */
#define DFWP__WPROT_L                    (0x0002)
#define FRWPOA                           (0x00fc)        /* */
#define FRWPOA_L                         (0x00fc)
#define FRWPOA0                          (0x0004)        /* */
#define FRWPOA0_L                        (0x0004)
#define FRWPOA1                          (0x0008)        /* */
#define FRWPOA1_L                        (0x0008)
#define FRWPOA2                          (0x0010)        /* */
#define FRWPOA2_L                        (0x0010)
#define FRWPOA3                          (0x0020)        /* */
#define FRWPOA3_L                        (0x0020)
#define FRWPOA4                          (0x0040)        /* */
#define FRWPOA4_L                        (0x0040)
#define FRWPOA5                          (0x0080)        /* */
#define FRWPOA5_L                        (0x0080)

/* SYSCFG1 Control Bits */
#define IREN                             (0x0001)        /* */
#define IREN_L                           (0x0001)
#define IREN_0                           (0x0000)        /* Infrared function disabled */
#define IREN_1                           (0x0001)        /* Infrared function enabled */
#define IREN_1_L                         (0x0001)
#define IREN__DIS                        (0x0000)        /* Infrared function disabled */
#define IREN__EN                         (0x0001)        /* Infrared function enabled */
#define IREN__EN_L                       (0x0001)
#define IRPSEL                           (0x0002)        /* */
#define IRPSEL_L                         (0x0002)
#define IRPSEL_0                         (0x0000)        /* Normal polarity */
#define IRPSEL_1                         (0x0002)        /* Inverted polarity */
#define IRPSEL_1_L                       (0x0002)
#define IRPSEL__NORM                     (0x0000)        /* Normal polarity */
#define IRPSEL__INV                      (0x0002)        /* Inverted polarity */
#define IRPSEL__INV_L                    (0x0002)
#define IRMSEL                           (0x0004)        /* */
#define IRMSEL_L                         (0x0004)
#define IRMSEL_0                         (0x0000)        /* ASK mode */
#define IRMSEL_1                         (0x0004)        /* FSK mode */
#define IRMSEL_1_L                       (0x0004)
#define IRMSEL__ASK                      (0x0000)        /* ASK mode */
#define IRMSEL__FSK                      (0x0004)        /* FSK mode */
#define IRMSEL__FSK_L                    (0x0004)
#define IRDSSEL                          (0x0008)        /* */
#define IRDSSEL_L                        (0x0008)
#define IRDSSEL_0                        (0x0000)        /* From hardware peripherals upon device configuration */
#define IRDSSEL_1                        (0x0008)        /* From IRDATA bit */
#define IRDSSEL_1_L                      (0x0008)
#define IRDSSEL__HW                      (0x0000)        /* From hardware peripherals upon device configuration */
#define IRDSSEL__IRDATA                  (0x0008)        /* From IRDATA bit */
#define IRDSSEL__IRDATA_L                (0x0008)
#define IRDATA                           (0x0010)        /* */
#define IRDATA_L                         (0x0010)
#define IRDATA_0                         (0x0000)        /* Infrared data logic 0 */
#define IRDATA_1                         (0x0010)        /* Infrared data logic 1 */
#define IRDATA_1_L                       (0x0010)
#define IRDATA__LOW                      (0x0000)        /* Infrared data logic 0 */
#define IRDATA__HIGH                     (0x0010)        /* Infrared data logic 1 */
#define IRDATA__HIGH_L                   (0x0010)
#define SYNCSEL                          (0x00c0)        /* */
#define SYNCSEL_L                        (0x00c0)
#define SYNCSEL0                         (0x0040)        /* */
#define SYNCSEL0_L                       (0x0040)
#define SYNCSEL1                         (0x0080)        /* */
#define SYNCSEL1_L                       (0x0080)
#define SYNCSEL_0                        (0x0000)        /* External source is selected */
#define SYNCSEL_1                        (0x0040)        /* ADC as the source is selected */
#define SYNCSEL_1_L                      (0x0040)
#define SYNCSEL_2                        (0x0080)        /* Comparator as the source is selected */
#define SYNCSEL_2_L                      (0x0080)
#define SYNCSEL_3                        (0x00c0)        /* Reserved */
#define SYNCSEL_3_L                      (0x00c0)

/* SYSCFG2 Control Bits */
#define RTCCKSEL                         (0x0400)        /* */
#define RTCCKSEL_H                       (0x0004)
#define RTCCKSEL_0                       (0x0000)        /* SMCLK is selected */
#define RTCCKSEL_1                       (0x0400)        /* ACLK is selected */
#define RTCCKSEL_1_H                     (0x0004)
#define USCIB0RMP                        (0x0800)        /* */
#define USCIB0RMP_H                      (0x0008)
#define USCIB0RMP_0                      (0x0000)        /* Default function. See the device-specific data sheet for 
                                                            details. */
#define USCIB0RMP_1                      (0x0800)        /* Remapped function. See the device-specific data sheet for 
                                                            details. */
#define USCIB0RMP_1_H                    (0x0008)
#define TB0TRGSEL                        (0x8000)        /* */
#define TB0TRGSEL_H                      (0x0080)
#define TB0TRGSEL_0                      (0x0000)        /* Internal source is selected */
#define TB0TRGSEL_1                      (0x8000)        /* External source is selected */
#define TB0TRGSEL_1_H                    (0x0080)

